xffxxf/myir-optee/core/arch/arm/plat-stm32mp1/drivers/stm32mp1_stpmic1.c
/*
 * int stm32mp_pmic_set_lp_config(char *lp_state)
 *
 * Load the low power configuration stored in regu_lp_state[].
 */
void stm32mp_pmic_apply_lp_config(const char *lp_state)
{
	unsigned int state_idx = regu_lp_state2idx(lp_state);
	struct regu_lp_state *state = &regu_lp_state[state_idx];
	size_t i = 0;

	if (stpmic1_powerctrl_on())
		panic();

	for (i = 0; i < state->cfg_count; i++) {
		struct stpmic1_lp_cfg *cfg = &state->cfg[i].cfg;

		if ((state->cfg[i].flags & REGU_LP_FLAG_LOAD_PWRCTRL) &&
		    stpmic1_lp_load_unpg(cfg))
			panic();

		if ((state->cfg[i].flags & REGU_LP_FLAG_ON_IN_SUSPEND) &&
		    stpmic1_lp_on_off_unpg(cfg, 1))
			panic();

		if ((state->cfg[i].flags & REGU_LP_FLAG_OFF_IN_SUSPEND) &&
		    stpmic1_lp_on_off_unpg(cfg, 0))
			panic();

		if ((state->cfg[i].flags & REGU_LP_FLAG_SET_VOLTAGE) &&
		    stpmic1_lp_voltage_unpg(cfg))
			panic();

		if ((state->cfg[i].flags & REGU_LP_FLAG_MODE_STANDBY) &&
		    stpmic1_lp_mode_unpg(cfg, 1))
			panic();
	}
}

/* Return a libfdt compliant status value */
static int save_cpu_supply_name(void)
{
	void *fdt = NULL;
	int node = 0;
	const fdt32_t *cuint = NULL;
	const char *name = NULL;

	fdt = get_embedded_dt();
	if (!fdt)
		panic();

	node = fdt_path_offset(fdt, "/cpus/cpu@0");
	if (node < 0)
		return -FDT_ERR_NOTFOUND;

	cuint = fdt_getprop(fdt, node, "cpu-supply", NULL);
	if (!cuint)
		return -FDT_ERR_NOTFOUND;

	node = fdt_node_offset_by_phandle(fdt, fdt32_to_cpu(*cuint));
	if (node < 0)
		return -FDT_ERR_NOTFOUND;

	name = fdt_get_name(fdt, node, NULL);
	assert(strnlen(name, sizeof(cpu_supply_name)) <
	       sizeof(cpu_supply_name));

	strncpy(cpu_supply_name, name, sizeof(cpu_supply_name));

	return 0;
}

const char *stm32mp_pmic_get_cpu_supply_name(void)
{
	return cpu_supply_name;
}

/* Preallocate not that much regu references */
static char *nsec_access_regu_name[PMIC_REGU_COUNT];

bool stm32mp_nsec_can_access_pmic_regu(const char *name)
{
	size_t n = 0;

	for (n = 0; n < ARRAY_SIZE(nsec_access_regu_name); n++)
		if (nsec_access_regu_name[n] &&
		    !strcmp(nsec_access_regu_name[n], name))
			return true;

	return false;
}

static void register_nsec_regu(const char *name_ref)
{
	size_t n = 0;

	assert(!stm32mp_nsec_can_access_pmic_regu(name_ref));

	for (n = 0; n < ARRAY_SIZE(nsec_access_regu_name); n++) {
		if (!nsec_access_regu_name[n]) {
			nsec_access_regu_name[n] = strdup(name_ref);

			if (!nsec_access_regu_name[n])
				panic();
			break;
		}
	}

	assert(stm32mp_nsec_can_access_pmic_regu(name_ref));
}

static TEE_Result pmic_set_state(struct regulator *regulator, bool enable)
{
	struct pmic_regulator_data *priv = regulator->priv;
	int ret = 0;

	stm32mp_get_pmic();

	if (enable)
		ret = stpmic1_regulator_enable(priv->regu_name);
	else
		ret = stpmic1_regulator_disable(priv->regu_name);

	stm32mp_put_pmic();

	if (ret)
		return TEE_ERROR_GENERIC;

	return TEE_SUCCESS;
}

static TEE_Result pmic_get_state(struct regulator *regulator, bool *enabled)
{
	struct pmic_regulator_data *priv = regulator->priv;

	stm32mp_get_pmic();
	*enabled = stpmic1_is_regulator_enabled(priv->regu_name);
	stm32mp_put_pmic();

	return TEE_SUCCESS;
}

static TEE_Result pmic_get_voltage(struct regulator *regulator, int *level_uv)
{
	struct pmic_regulator_data *priv = regulator->priv;
	int rc = 0;

	stm32mp_get_pmic();
	rc = stpmic1_regulator_voltage_get(priv->regu_name);
	stm32mp_put_pmic();

	if (rc < 0)
		return TEE_ERROR_GENERIC;

	*level_uv = rc * 1000;

	return TEE_SUCCESS;
}

static TEE_Result pmic_set_voltage(struct regulator *regulator, int level_uv)
{
	struct pmic_regulator_data *priv = regulator->priv;
	unsigned int level_mv = level_uv / 1000;
	int rc = 0;

	if (level_mv > UINT16_MAX)
		return TEE_ERROR_BAD_PARAMETERS;

	stm32mp_get_pmic();
	rc = stpmic1_regulator_voltage_set(priv->regu_name, level_mv);
	stm32mp_put_pmic();

	if (rc)
		return TEE_ERROR_GENERIC;

	return TEE_SUCCESS;
}

static size_t refine_levels_array(size_t count, int *levels_uv,
				  int min_uv, int max_uv)
{
	size_t n = 0;
	size_t m = 0;

	/* We need to sort the array has STPMIC1 driver does not */
	qsort_int(levels_uv, count);

	/* Remove duplicates and return optimized count */
	for (n = 1; n < count; n++) {
		if (levels_uv[m] != levels_uv[n]) {
			if (m + 1 != n)
				levels_uv[m + 1] = levels_uv[n];
			m++;
		}
	}
	count = m + 1;

	for (n = count; n; n--)
		if (levels_uv[n - 1] <= max_uv)
			break;
	count = n;

	for (n = 0; n < count; n++)
		if (levels_uv[n] >= min_uv)
			break;
	count -= n;

	memmove(levels_uv, levels_uv + n, count * sizeof(*levels_uv));

	return count;
}

static TEE_Result pmic_list_voltages(struct regulator *regulator,
				     struct regulator_voltages_desc **out_desc,
				     const int **out_levels)
{
	struct pmic_regulator_data *priv = regulator->priv;

	if (!priv->voltages_level) {
		const uint16_t *level_ref = NULL;
		size_t level_count = 0;
		int *levels2 = NULL;
		int *levels = NULL;
		size_t n = 0;

		/*
		 * Allocate and build a consised and ordered voltage list
		 * based on the voltage list provided by stpmic1 driver.
		 */
		stpmic1_regulator_levels_mv(priv->regu_name, &level_ref,
					    &level_count);

		levels = calloc(level_count, sizeof(*levels));
		if (!levels)
			return TEE_ERROR_OUT_OF_MEMORY;
		for (n = 0; n < level_count; n++)
			levels[n] = level_ref[n] * 1000;

		level_count = refine_levels_array(level_count, levels,
						  regulator->min_uv,
						  regulator->max_uv);

		/* Shrink levels array to not waste heap memory */
		levels2 = realloc(levels, sizeof(*levels) * level_count);
		if (!levels2) {
			free(levels);
			return TEE_ERROR_OUT_OF_MEMORY;
		}

		priv->voltages_desc.type = VOLTAGE_TYPE_FULL_LIST;
		priv->voltages_desc.num_levels = level_count;
		priv->voltages_level = levels2;
	}

	*out_desc = &priv->voltages_desc;
	*out_levels = priv->voltages_level;

	return TEE_SUCCESS;
}

static TEE_Result pmic_regu_pm(enum pm_op op, uint32_t pm_hint __unused,
			       const struct pm_callback_handle *pm_handle)
{
	struct regulator *regulator = pm_handle->handle;
	struct pmic_regulator_data *priv = regulator->priv;

