xffxxf/myir-optee/core/arch/arm/plat-stm32mp1/drivers/stm32mp1_stpmic1.c
	/*
	 * Enable regulators flagged warm-boot-on before entering suspend
	 * to ensure it is enabled after standby when the boot-rom reloads
	 * the binaries.
	 */
	if (priv->flags & PMIC_REGU_FLAG_WARM_BOOT_ON) {
		TEE_Result res = TEE_ERROR_GENERIC;

		if (op == PM_OP_SUSPEND)
			res = regulator_enable(regulator);
		else if (op == PM_OP_RESUME)
			res = regulator_disable(regulator);

		if (res) {
			EMSG("Failed to handle warm-boot-on");
			return res;
		}
	}

	return TEE_SUCCESS;
}

static TEE_Result pmic_regu_init(struct regulator *regulator)
{
	/* Default configuration for STPMIC regulators */
	regulator->ramp_delay_uv_per_us = U(2200);
	regulator->enable_ramp_delay_us = U(1000);

	return TEE_SUCCESS;
}

static TEE_Result pmic_sw_init(struct regulator *regulator)
{
	/* Default configuration for STPMIC power switch */
	regulator->enable_ramp_delay_us = U(1000);

	return TEE_SUCCESS;
}

static TEE_Result pmic_supplied_init(struct regulator *regulator,
				     const void *fdt __unused,
				     int node __unused)
{
	struct pmic_regulator_data *priv = regulator->priv;
	struct stpmic1_bo_cfg cfg = { };

	if (!priv->flags)
		return TEE_SUCCESS;

	stm32mp_get_pmic();

	if (priv->flags & PMIC_REGU_FLAG_MASK_RESET) {
		if (stpmic1_bo_mask_reset_cfg(priv->regu_name, &cfg) ||
		    stpmic1_bo_mask_reset_unpg(&cfg)) {
			EMSG("Mask reset failed for %s", priv->regu_name);
			return TEE_ERROR_GENERIC;
		}
	}

	if (regulator->flags & REGULATOR_PULL_DOWN) {
		if (stpmic1_bo_pull_down_cfg(priv->regu_name, &cfg) ||
		    stpmic1_bo_pull_down_unpg(&cfg)) {
			EMSG("Pull down failed for %s", priv->regu_name);
			return TEE_ERROR_GENERIC;
		}
	}

	stm32mp_put_pmic();

	register_pm_core_service_cb(pmic_regu_pm, regulator,
				    regulator_name(regulator));

	return TEE_SUCCESS;
}

static const struct regulator_ops pmic_regu_ops = {
	.set_state = pmic_set_state,
	.get_state = pmic_get_state,
	.set_voltage = pmic_set_voltage,
	.get_voltage = pmic_get_voltage,
	.supported_voltages = pmic_list_voltages,
	.init = pmic_regu_init,
	.supplied_init = pmic_supplied_init,
};
DECLARE_KEEP_PAGER_PM(pmic_regu_ops);

static const struct regulator_ops pmic_sw_ops = {
	.set_state = pmic_set_state,
	.get_state = pmic_get_state,
	.init = pmic_sw_init,
	.supplied_init = pmic_supplied_init,
};
DECLARE_KEEP_PAGER_PM(pmic_sw_ops);

/*
 * STPMIC1 regulator names, used in the DT as regulator node name and
 * provider node <name>-supply property,
 */
static const char * const pmic_regu_name_ids[] = {
	"buck1", "buck2", "buck3", "buck4",
	"ldo1", "ldo2", "ldo3", "ldo4", "ldo5", "ldo6",
	"vref_ddr", "boost", "pwr_sw1", "pwr_sw2"
};

/* Preallocated regulator instances */
static struct regulator pmic_regulators[ARRAY_SIZE(pmic_regu_name_ids)];
static struct pmic_regulator_data pmic_regu_cfg[ARRAY_SIZE(pmic_regu_name_ids)];

static TEE_Result release_voltage_lists(void)
{
	size_t n = 0;

	/* Voltage list will be rebuilt at runtime if needed at least once */
	for (n = 0; n < ARRAY_SIZE(pmic_regulators); n++) {
		struct pmic_regulator_data *priv = pmic_regulators[n].priv;

		if (priv && priv->voltages_level) {
			free(priv->voltages_level);
			priv->voltages_level = NULL;
		}
	}

	return TEE_SUCCESS;
}

release_init_resource(release_voltage_lists);

struct regulator *stm32mp_pmic_get_regulator(const char *name)
{
	size_t i = 0;

	if (!name)
		return NULL;

	for (i = 0; i < ARRAY_SIZE(pmic_regu_name_ids); i++)
		if (!strcmp(pmic_regu_name_ids[i], name) &&
		    pmic_regulators[i].ops)
			return pmic_regulators + i;

	return NULL;
}

static TEE_Result register_pmic_regulator(const void *fdt,
					  const char *regu_name, int regu_node,
					  int regulators_node)
{
	TEE_Result res = TEE_ERROR_GENERIC;
	struct regu_dt_desc desc = { };
	size_t i = 0;

	for (i = 0; i < ARRAY_SIZE(pmic_regu_name_ids); i++)
		if (!strcmp(pmic_regu_name_ids[i], regu_name))
			break;
	if (i >= ARRAY_SIZE(pmic_regu_name_ids)) {
		EMSG("Unknown regulator name %s", regu_name);
		panic();
	}

	desc = (struct regu_dt_desc){
		.name = pmic_regu_name_ids[i],
		.supply_name = pmic_regu_name_ids[i],
		.regulator = pmic_regulators + i,
		.priv = pmic_regu_cfg + i,
	};

	priv_dt_properties(fdt, regu_node, pmic_regu_cfg + i);

	/*
	 * pwr_sw1 and pwr_sw2 are regulator switches hence have no
	 * set_voltage.get_voltage handler.
	 */
	if (!strncmp(regu_name, "pwr_sw", 6))
		desc.ops = &pmic_sw_ops;
	else
		desc.ops = &pmic_regu_ops;

	res = regulator_dt_register(fdt, regu_node, regulators_node, &desc);
	if (res)
		EMSG("Failed to register %s, error: %#"PRIx32, regu_name, res);

	return res;
}

static void parse_regulator_fdt_nodes(const void *fdt, int pmic_node)
{
	int regulators_node = 0;
	int regu_node = 0;

	regulators_node = fdt_subnode_offset(fdt, pmic_node, "regulators");
	if (regulators_node < 0)
		panic();

	fdt_for_each_subnode(regu_node, fdt, regulators_node) {
		int status = fdt_get_status(fdt, regu_node);
		const char *regu_name = NULL;
		size_t n = 0;

		assert(status >= 0);
		if (status == DT_STATUS_DISABLED)
			continue;

		regu_name = fdt_get_name(fdt, regu_node, NULL);

		assert(stpmic1_regulator_is_valid(regu_name));

		if (status & DT_STATUS_OK_NSEC)
			register_nsec_regu(regu_name);

		for (n = 0; n < ARRAY_SIZE(regu_lp_state); n++)
			dt_get_regu_low_power_config(fdt, regu_name, regu_node,
						     regu_lp_state[n].name);

		if (register_pmic_regulator(fdt, regu_name, regu_node,
					    regulators_node))
			panic();
	}

	if (save_cpu_supply_name())
		DMSG("No CPU supply provided");
}

/*
 * PMIC and resource initialization
 */

static void initialize_pmic_i2c(const void *fdt, int pmic_node)
{
	const fdt32_t *cuint = NULL;

	cuint = fdt_getprop(fdt, pmic_node, "reg", NULL);
	if (!cuint) {
		EMSG("PMIC configuration failed on reg property");
		panic();
	}

	pmic_i2c_addr = fdt32_to_cpu(*cuint) << 1;
	if (pmic_i2c_addr > UINT16_MAX) {
		EMSG("PMIC configuration failed on i2c address translation");
		panic();
	}

	stm32mp_get_pmic();

	if (!stm32_i2c_is_device_ready(i2c_handle, pmic_i2c_addr,
				       PMIC_I2C_TRIALS,
				       PMIC_I2C_TIMEOUT_BUSY_MS))
		panic();

	stpmic1_bind_i2c(i2c_handle, pmic_i2c_addr);

	stm32mp_put_pmic();
}

/* stm32mp_get/put_pmic allows secure atomic sequences to use non secure PMIC */
void stm32mp_get_pmic(void)
{
	if (!pmic_is_secure())
		stm32_i2c_resume(i2c_handle);
}

void stm32mp_put_pmic(void)
{
	if (!pmic_is_secure())
		stm32_i2c_suspend(i2c_handle);
}

static void register_non_secure_pmic(void)
{
	/* Allow this function to be called when STPMIC1 not used */
	if (!i2c_handle->base.pa)
		return;

	stm32mp_register_non_secure_pinctrl(i2c_handle->pinctrl);
	if (i2c_handle->pinctrl_sleep)
		stm32mp_register_non_secure_pinctrl(i2c_handle->pinctrl_sleep);

