xffxxf/myir-optee/core/arch/arm/plat-stm32mp1/drivers/stm32mp1_stpmic1.c
	stm32mp_register_non_secure_periph_iomem(i2c_handle->base.pa);
}

static void register_secure_pmic(void)
{
	stm32mp_register_secure_pinctrl(i2c_handle->pinctrl);
	if (i2c_handle->pinctrl_sleep)
		stm32mp_register_secure_pinctrl(i2c_handle->pinctrl_sleep);

	stm32mp_register_secure_periph_iomem(i2c_handle->base.pa);
}

static void init_pmic_secure_state(void)
{
	if (i2c_handle->i2c_secure)
		pmic_status = DT_STATUS_OK_SEC;
	else
		pmic_status = DT_STATUS_OK_NSEC;
}

static TEE_Result initialize_pmic(const void *fdt, int pmic_node)
{
	unsigned long pmic_version = 0;

	init_pmic_state(fdt, pmic_node);

	init_pmic_secure_state();

	initialize_pmic_i2c(fdt, pmic_node);

	stm32mp_get_pmic();

	if (stpmic1_get_version(&pmic_version))
		panic("Failed to access PMIC");

	DMSG("PMIC version = 0x%02lx", pmic_version);
	stm32mp_put_pmic();

	if (pmic_is_secure())
		register_secure_pmic();
	else
		register_non_secure_pmic();

	parse_regulator_fdt_nodes(fdt, pmic_node);

	return TEE_SUCCESS;
}

static enum itr_return stpmic1_irq_handler(struct itr_handler *handler __unused)
{
	uint8_t read_val = 0U;
	unsigned int i = 0U;
	uint8_t latch1 = 0U;
	uint8_t latch2 = 0U;
	uint8_t latch3 = 0U;
	uint8_t latch4 = 0U;

	FMSG("Stpmic1 irq handler");

	stm32mp_get_pmic();

	do {
		for (i = 0U; i < 4U; i++) {
			if (stpmic1_register_read(ITLATCH1_REG + i, &read_val))
				panic();

			if (read_val) {
				struct pmic_it_handle_s *prv = NULL;

				FMSG("Stpmic1 irq pending %u: %#"PRIx8, i,
				     read_val);

				if (stpmic1_register_write(ITCLEARLATCH1_REG +
							   i, read_val))
					panic();

				SLIST_FOREACH(prv, &pmic_it_handle_list, link)
					if ((prv->pmic_reg == ITCLEARMASK1_REG +
					     i) &&
					    (read_val & BIT(prv->pmic_bit))) {
						FMSG("STPMIC1 send notif %u",
						     prv->notif_id);

						notif_send_it(prv->notif_id);
				}
			}
		}

		stpmic1_register_read(ITLATCH1_REG, &latch1);
		stpmic1_register_read(ITLATCH2_REG, &latch2);
		stpmic1_register_read(ITLATCH3_REG, &latch3);
		stpmic1_register_read(ITLATCH4_REG, &latch4);

	} while ((latch1 != 0) || (latch2 != 0) || (latch3 != 0) ||
		 (latch4 != 0));

	stm32mp_put_pmic();

	return ITRR_HANDLED;
}

static TEE_Result stm32_pmic_init_it(const void *fdt, int node)
{
	TEE_Result res = TEE_ERROR_GENERIC;
	const uint32_t *notif_ids = NULL;
	int nb_notif = 0;
	size_t pwr_it = 0;
	struct itr_handler *hdl = NULL;
	const fdt32_t *cuint = NULL;
	uint32_t phandle = 0;
	int wakeup_parent_node = 0;
	int len = 0;

	cuint = fdt_getprop(fdt, node, "wakeup-parent", &len);
	if (!cuint || len != sizeof(uint32_t))
		panic("Missing wakeup-parent");

	phandle = fdt32_to_cpu(*cuint);
	if (!dt_driver_get_provider_by_phandle(phandle,
					       DT_DRIVER_NOTYPE))
		return TEE_ERROR_DEFER_DRIVER_INIT;

	wakeup_parent_node = fdt_node_offset_by_phandle(fdt, phandle);

	cuint = fdt_getprop(fdt, node, "st,wakeup-pin-number", NULL);
	if (!cuint) {
		DMSG("Missing wake-up pin description");
		return TEE_SUCCESS;
	}

	pwr_it = fdt32_to_cpu(*cuint) - 1U;

	notif_ids = fdt_getprop(fdt, node, "st,notif-it-id", &nb_notif);
	if (!notif_ids)
		return TEE_ERROR_ITEM_NOT_FOUND;

	if (nb_notif > 0) {
		struct pmic_it_handle_s *prv = NULL;
		unsigned int i = 0;
		const uint32_t *pmic_its = NULL;
		int nb_it = 0;

		pmic_its = fdt_getprop(fdt, node, "st,pmic-it-id", &nb_it);
		if (!pmic_its)
			return TEE_ERROR_ITEM_NOT_FOUND;

		if (nb_it != nb_notif)
			panic("st,notif-it-id incorrect description");

		for (i = 0; i < (nb_notif / sizeof(uint32_t)); i++) {
			uint8_t val = 0;
			uint8_t pmic_it = 0;

			prv = calloc(1, sizeof(*prv));
			if (!prv)
				panic("pmic: Could not allocate pmic it");

			pmic_it = fdt32_to_cpu(pmic_its[i]);

			assert(pmic_it <= IT_SWIN_R);

			prv->pmic_reg = ITCLEARMASK1_REG + pmic_it / U(8);
			prv->pmic_bit = pmic_it % U(8);
			prv->notif_id = fdt32_to_cpu(notif_ids[i]);

			SLIST_INSERT_HEAD(&pmic_it_handle_list, prv, link);

			stm32mp_get_pmic();

			/* Enable requested interrupt */
			if (stpmic1_register_read(prv->pmic_reg, &val))
				panic();

			val |= BIT(prv->pmic_bit);

			if (stpmic1_register_write(prv->pmic_reg, val))
				panic();

			stm32mp_put_pmic();

			FMSG("STPMIC1 forwards irq reg:%u bit:%u as notif:%u",
			     prv->pmic_reg, prv->pmic_bit, prv->notif_id);
		}
	}

	res = stm32mp1_pwr_itr_alloc_add(fdt, wakeup_parent_node, pwr_it,
					 stpmic1_irq_handler,
					 PWR_WKUP_FLAG_FALLING |
					 PWR_WKUP_FLAG_THREADED,
					 NULL, &hdl);
	if (res)
		panic("pmic: Could not allocate itr");

	stm32mp1_pwr_itr_enable(hdl->it);

	return res;
}

static TEE_Result stm32_pmic_probe(const void *fdt, int node,
				   const void *compat_data __unused)
{
	struct stm32_i2c_dev *stm32_i2c_dev = NULL;
	struct i2c_dev *i2c_dev = NULL;
	TEE_Result res = TEE_SUCCESS;

	res = i2c_dt_get_dev(fdt, node, &i2c_dev);
	if (res)
		return res;

	stm32_i2c_dev = container_of(i2c_dev, struct stm32_i2c_dev, i2c_dev);
	i2c_handle = stm32_i2c_dev->handle;

	res = initialize_pmic(fdt, node);
	if (res) {
		DMSG("Unexpectedly failed to get I2C bus: %#"PRIx32, res);
		panic();
	}

	if (IS_ENABLED(CFG_STM32MP13))
		res = stm32_pmic_init_it(fdt, node);

	return res;
}

static const struct dt_device_match stm32_pmic_match_table[] = {
	{ .compatible = "st,stpmic1" },
	{ }
};

DEFINE_DT_DRIVER(stm32_pmic_dt_driver) = {
	.name = "st,stpmic1",
	.match_table = stm32_pmic_match_table,
	.probe = stm32_pmic_probe,
};
